lib/active_shipping/shipping/carriers/fedex/templates/shipment.xml.erb

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns='http://fedex.com/ws/ship/v13'>
  <soapenv:Body>
    <ProcessShipmentRequest>
      <WebAuthenticationDetail>
        <UserCredential>
          <Key><%= @key %></Key>
          <Password><%= @password %></Password>
        </UserCredential>
      </WebAuthenticationDetail>
      <ClientDetail>
        <AccountNumber><%= @accountNumber %></AccountNumber>
        <MeterNumber><%= @meterNumber %></MeterNumber>
      </ClientDetail>
      <% if @transactionId -%>
        <TransactionDetail>
          <CustomerTransactionId><%= @transactionId %></CustomerTransactionId>
        </TransactionDetail>
      <% end %>
      <Version>
        <ServiceId>ship</ServiceId>
        <Major>13</Major>
        <Intermediate>0</Intermediate>
        <Minor>0</Minor>
      </Version>
      <RequestedShipment>
        <ShipTimestamp><%= Time.now.utc.iso8601(2) %></ShipTimestamp>
        <DropoffType>REGULAR_PICKUP</DropoffType>
        <ServiceType><%= @service_type %></ServiceType>                
        <PackagingType><%= @packaging_type %></PackagingType>

        <% if @master_tracking_id %>
          <MasterTrackingId>
            <TrackingIdType><%= @tracking_id_type %></TrackingIdType>
            <FormId><%= @form_id %></FormId>
            <TrackingNumber><%= @master_tracking_id %></TrackingNumber>
          </MasterTrackingId>    
        <% end %>    
        
        <% if @first_package && @total_weight %>
          <TotalWeight>
            <Units>KG</Units>
            <Value><%= @total_weight %></Value>
          </TotalWeight>        
        <% end %>                
        
        <% if @preferred_currency %>
          <PreferredCurrency><%= @preferred_currency %></PreferredCurrency>
        <% end %>
        <% if @insured_value && @insured_currency %>
          <TotalInsuredValue>
            <Currency><%= @insured_currency %></Currency>
            <Amount><%= @insured_value %></Amount>            
          </TotalInsuredValue>
        <% end %>        
        <Shipper>
          <% if @contact_shipper_fullname -%>
            <Contact>
              <% if @contact_shipper_fullname -%>
                <PersonName><%= @contact_shipper_fullname %></PersonName>
              <% end %>
              <% if @contact_shipper_company -%>
                <CompanyName><%= @contact_shipper_company %></CompanyName>
              <% end %>              
              <% if @contact_shipper_phonenumber -%>
                <PhoneNumber><%= @contact_shipper_phonenumber %></PhoneNumber>            
              <% end %>
              <% if @contact_shipper_phonenumber_ext -%>  
                <PhoneExtension><%= @contact_shipper_phonenumber_ext %></PhoneExtension>                        
              <% end %>
            </Contact>
          <% end %>
          <Address>
            <% if @shipper_address_line -%>
              <StreetLines><%= @shipper_address_line %></StreetLines>
            <% end %>
            <% if @shipper_city -%>
              <City><%= @shipper_city %></City>
            <% end %>
            <% if @shipper_provincecode %>            
              <StateOrProvinceCode><%= @shipper_provincecode %></StateOrProvinceCode>                        
            <% end %>
            <PostalCode><%= @shipper_postalcode %></PostalCode>
            <CountryCode><%= @shipper_countrycode %></CountryCode>
          </Address>
        </Shipper>
        <Recipient>
          <% if @contact_recipient_fullname -%>
            <Contact>
              <% if @contact_recipient_fullname -%>
                <PersonName><%= @contact_recipient_fullname %></PersonName>
              <% end %>
              <% if @contact_recipient_company -%>
                <CompanyName><%= @contact_recipient_company %></CompanyName>
              <% end %>
              <% if @contact_recipient_phonenumber -%>            
                <PhoneNumber><%= @contact_recipient_phonenumber %></PhoneNumber>            
              <% end %>
              <% if @contact_recipient_phonenumber_ext -%>
                <PhoneExtension><%= @contact_recipient_phonenumber_ext %></PhoneExtension>                        
              <% end %>
            </Contact>
          <% end %>
          <Address>
            <% if @recipient_address_line -%>            
              <StreetLines><%= @recipient_address_line %></StreetLines>
            <% end %>
            <% if @recipient_city -%>            
              <City><%= @recipient_city %></City>
            <% end %>
            <% if @recipient_provincecode %>
              <StateOrProvinceCode><%= @recipient_provincecode %></StateOrProvinceCode>                  
            <% end %>
            <PostalCode><%= @recipient_postalcode %></PostalCode>      
            <CountryCode><%= @recipient_countrycode %></CountryCode>
            <Residential>false</Residential>
          </Address>
        </Recipient>
        <ShippingChargesPayment>
          <PaymentType>SENDER</PaymentType>
          <Payor>
            <ResponsibleParty>
              <AccountNumber><%= @accountNumber %></AccountNumber>
              <Contact />
            </ResponsibleParty>
          </Payor>
        </ShippingChargesPayment> 
        <% if @declared_value %>
          <CustomsClearanceDetail>
            <CustomsValue>
              <Currency><%= @declared_currency %></Currency>
              <Amount><%= @declared_value %></Amount>
            </CustomsValue>
          </CustomsClearanceDetail>            
        <% end %>
        <LabelSpecification>
          <LabelFormatType>COMMON2D</LabelFormatType>
          <ImageType>PDF</ImageType>
          <LabelStockType>PAPER_7X4.75</LabelStockType>
        </LabelSpecification>                               
        <RateRequestTypes>ACCOUNT</RateRequestTypes>
        <PackageCount><%= @package_count %></PackageCount>
        <% if @package && @package_count > 0 %>
          <RequestedPackageLineItems>   
            <% if @sequence_number %>                             
              <SequenceNumber><%= @sequence_number %></SequenceNumber>
            <% end %>
            <GroupPackageCount>1</GroupPackageCount>
            <% if @insured_value && @insured_currency %>            
              <InsuredValue>
                <Currency><%= @insured_currency %></Currency>
                <Amount><%= @insured_value %></Amount>
              </InsuredValue>                         
            <% end %>              
            <Weight>
              <Units>KG</Units>
              <Value><%= @package.weight -%></Value>
            </Weight>
            <% if @packaging_type == "YOUR_PACKAGING "%>
              <Dimensions>
                <Length><%= @package.length -%></Length>
                <Width><%= @package.width -%></Width>
                <Height><%= @package.height -%></Height>
                <Units>CM</Units>
              </Dimensions>            
            <% end -%>              
          </RequestedPackageLineItems>  
        <% end -%>                                  
      </RequestedShipment>
    </ProcessShipmentRequest>
  </soapenv:Body>
</soapenv:Envelope>